zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW47B42ZB7/KW47B42ZB7_cm33_core1_features.h
/* SPC module features */

/* @brief Has 2P4G power domain. */
#define FSL_FEATURE_SPC_HAS_2P4G_POWER_DOMAIN (1)
/* @brief Has SPC_CFG. */
#define FSL_FEATURE_SPC_HAS_CFG_REGISTER (1)
/* @brief Has core ldo vdd driver strength (register bit ACTIVE_CFG[CORELDO_VDD_DS]). */
#define FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS (1)
/* @brief Has bias enable (register bit LP_CFG[WBIAS_EN]). */
#define FSL_FEATURE_SPC_HAS_WBIAS_EN (0)
/* @brief Set CORELDO_VDD_LVL to 0 then regulate to Under Drive Voltage (0.95v). */
#define FSL_FEATURE_SPC_LDO_VOLTAGE_LEVEL_DECREASE (0)
/* @brief Set DCDC_VDD_LVL to 0 then regulate to Low Under Voltage (1.25v). */
#define FSL_FEATURE_SPC_DCDC_VOLTAGE_LEVEL_DECREASE (0)
/* @brief Has SC REG_BUSY (register bit SC[REG_BUSY]). */
#define FSL_FEATURE_SPC_HAS_SC_REG_BUSY (1)
/* @brief Has HP_CFG register. */
#define FSL_FEATURE_SPC_HAS_HP_CFG_REG (1)
/* @brief SPC Power Mode Configuration Status Flag. */
#define FSL_FEATURE_SPC_HAS_SC_SPC_LP_REQ_BIT (1)
/* @brief Has DCDC_BURST_CFG register. */
#define FSL_FEATURE_SPC_HAS_DCDC_BURST_CFG (1)
/* @brief Has SYSLDO_CFG register. */
#define FSL_FEATURE_SPC_HAS_SYS_LDO (1)
/* @brief Has cmp bandgap buffer enable. */
#define FSL_FEATURE_SPC_HAS_LPBUFF (1)
/* @brief Has VD_SYS_CFG register. */
#define FSL_FEATURE_SPC_HAS_VDD_SYS (1)
/* @brief Has VDD1P8 low-voltage detect feature. */
#define FSL_FEATURE_SPC_HAS_VDD1P8_LVD (0)
/* @brief Has no DCDC frequency control (register bits DCDC_CFG[FREQ_CNTRL_ON/FREQ_CNTRL]). */
#define FSL_FEATURE_SPC_HAS_NO_DCDC_FREQ_CNTRL (0)
/* @brief Has DCDC 2.5V output select (register bits ACTIVE_CFG/HP_CFG[DCDC_VOUT2P5_SEL]) or (DCDC_CFG[VOUT2P5_SEL]). */
#define FSL_FEATURE_SPC_HAS_DCDC_VOUT2P5_SEL (1)
/* @brief DCDC 2.5V output select is in the per-mode ACTIVE_CFG/HP_CFG registers (vs DCDC_CFG). */
#define FSL_FEATURE_SPC_DCDC_VOUT2P5_SEL_IN_ACTIVE_CFG (0)
/* @brief Has DCDC output voltage ramp control (register bits DCDC_CFG[RAMP_CNTRL_EN/RAMP_CNTRL]). */
#define FSL_FEATURE_SPC_HAS_DCDC_RAMP_CNTRL (1)
/* @brief Has DCDC low-power ramp control (register bit DCDC_CFG[RAMP_CNTRL_LP]). */
#define FSL_FEATURE_SPC_HAS_DCDC_RAMP_CNTRL_LP (0)

/* SYSPM module features */

/* @brief SYSPM support disable counters if stopped or halted. */
#define FSL_FEATURE_SYSPM_HAS_PMCR_DCIFSH (1)
/* @brief SYSPM has reset instruction counter. */
#define FSL_FEATURE_SYSPM_HAS_PMCR_RICTR (1)
/* @brief Number of PMCR registers signals number of performance monitors available in single SYSPM instance. */
#define FSL_FEATURE_SYSPM_PMCR_COUNT (2)
/* @brief SYSPM has instruction counter. */
#define FSL_FEATURE_SYSPM_HAS_PMICTR (0)

/* TPM module features */

/* @brief Number of channels. */
#define FSL_FEATURE_TPM_CHANNEL_COUNTn(x) \
    (((x) == TPM0) ? (6) : \
    (((x) == TPM1) ? (6) : \
    (((x) == TPM2) ? (2) : (-1))))
/* @brief Has counter reset by the selected input capture event (register bits C0SC[ICRST], C1SC[ICRST], ...). */
#define FSL_FEATURE_TPM_HAS_COUNTER_RESET_BY_CAPTURE_EVENT (0)
/* @brief Has TPM_PARAM. */
#define FSL_FEATURE_TPM_HAS_PARAM (1)
/* @brief Has TPM_VERID. */
#define FSL_FEATURE_TPM_HAS_VERID (1)
/* @brief Has TPM_GLOBAL. */
#define FSL_FEATURE_TPM_HAS_GLOBAL (1)
/* @brief Has TPM_TRIG. */
#define FSL_FEATURE_TPM_HAS_TRIG (1)
/* @brief Whether TRIG register has effect. */
#define FSL_FEATURE_TPM_TRIG_HAS_EFFECTn(x) (1)
/* @brief Has counter pause on trigger. */
#define FSL_FEATURE_TPM_HAS_PAUSE_COUNTER_ON_TRIGGER (1)
/* @brief Has external trigger selection. */
#define FSL_FEATURE_TPM_HAS_EXTERNAL_TRIGGER_SELECTION (1)
/* @brief Has TPM_COMBINE register. */
#define FSL_FEATURE_TPM_HAS_COMBINE (1)
/* @brief Whether COMBINE register has effect. */
#define FSL_FEATURE_TPM_COMBINE_HAS_EFFECTn(x) (1)
/* @brief Has TPM_POL. */
#define FSL_FEATURE_TPM_HAS_POL (1)
/* @brief Whether POL register has effect. */
#define FSL_FEATURE_TPM_POL_HAS_EFFECTn(x) (1)
/* @brief Has TPM_FILTER register. */
#define FSL_FEATURE_TPM_HAS_FILTER (1)
/* @brief Whether FILTER register has effect. */
#define FSL_FEATURE_TPM_FILTER_HAS_EFFECTn(x) (1)
/* @brief Has TPM_QDCTRL register. */
#define FSL_FEATURE_TPM_HAS_QDCTRL (1)
/* @brief Whether QDCTRL register has effect. */
#define FSL_FEATURE_TPM_QDCTRL_HAS_EFFECTn(x) \
    (((x) == TPM0) ? (1) : \
    (((x) == TPM1) ? (1) : \
    (((x) == TPM2) ? (0) : (-1))))
/* @brief Has pause level select. */
#define FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT (1)
/* @brief Whether 32 bits counter has effect. */
#define FSL_FEATURE_TPM_HAS_32BIT_COUNTERn(x) (1)
/* @brief Has global time base enable. */
#define FSL_FEATURE_TPM_HAS_GLOBAL_TIME_BASE_EN (1)
/* @brief Has global time base sync. */
#define FSL_FEATURE_TPM_HAS_GLOBAL_TIME_BASE_SYNC (1)
/* @brief Is affected by errata with ID 050050 (Incorrect duty output when EPWM mode is set to PS=0 during write 1 to CnV register). */
#define FSL_FEATURE_TPM_HAS_ERRATA_050050 (0)
/* @brief Has no CPWMS field in SC register (bitfield SC[CPWMS]). */
#define FSL_FEATURE_TPM_HAS_NO_SC_CPWMS (0)

/* VREF module features */

/* @brief Has chop oscillator (bit TRM[CHOPEN]) */
#define FSL_FEATURE_VREF_HAS_CHOP_OSC (0)
/* @brief Has second order curvature compensation (bit SC[ICOMPEN]) */
#define FSL_FEATURE_VREF_HAS_COMPENSATION (0)
/* @brief If high/low buffer mode supported */
#define FSL_FEATURE_VREF_MODE_LV_TYPE (0)
/* @brief Module has also low reference (registers VREFL/VREFH) */
#define FSL_FEATURE_VREF_HAS_LOW_REFERENCE (0)
/* @brief Has VREF_TRM4. */
#define FSL_FEATURE_VREF_HAS_TRM4 (0)
/* @brief Has bitfield LPBG_BUF_EN in CSR register. */
#define FSL_FEATURE_VREF_HAS_LOWPOWER_BUFFER (1)
/* @brief Has bitfield LPBGEN in CSR register. */
#define FSL_FEATURE_VREF_HAS_LPBGEN (1)
/* @brief Has bitfield IBIAS_EN in CSR register. */
#define FSL_FEATURE_VREF_HAS_IBIAS_EN (0)
/* @brief Has bitfield REFCHSELN_EN in CSR register. */
#define FSL_FEATURE_VREF_HAS_REFCHSELN_EN (1)
/* @brief Has bitfield REFCHSELP_EN in CSR register. */
#define FSL_FEATURE_VREF_HAS_REFCHSELP_EN (1)
/* @brief Support max voltage of 2.5V. */
#define FSL_FEATURE_VREF_SUPPORT_2V5 (0)

/* WDOG module features */

/* @brief Watchdog is available. */
#define FSL_FEATURE_WDOG_HAS_WATCHDOG (1)
/* @brief WDOG_CNT can be 32-bit written. */
#define FSL_FEATURE_WDOG_HAS_32BIT_ACCESS (1)

/* WUU module features */

/* @brief Has MF register. */
#define FSL_FEATURE_WUU_HAS_MF (0)

#endif /* _KW47B42ZB7_cm33_core1_FEATURES_H_ */

